src/CF/Catalogs/ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УсловиеДополнительногоПоведенияПриИмпорте</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьПрограммныйКод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПоведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеДополнительногоПоведенияПриЭкспорте</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение/Ext/ManagerModule.bsl
//sza131227-0155 : 

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Справочники.ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ВыполнитьПрограммныйКод,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ДатаРедакции,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ДатаСоздания,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ЗначениеРеквизита,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ИмяРеквизита,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Код,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Наименование,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Описание,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Ответственный,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ПрограммныйКод,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.УсловиеДополнительногоПоведенияПриИмпорте,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ТаблицаПоведения.(
	|		НомерСтроки,
	|		ИмяТаблицы,
	|		ИмяРеквизита,
	|		УсловиеДополнительногоПоведенияПриЭкспорте,
	|		ЗначениеРеквизита
	|	)
	|ИЗ
	|	Справочник.ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение КАК ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение
	|ГДЕ
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаПоведенияШапка = Макет.ПолучитьОбласть("ТаблицаПоведенияШапка");
	ОбластьТаблицаПоведения = Макет.ПолучитьОбласть("ТаблицаПоведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаПоведенияШапка);
		ВыборкаТаблицаПоведения = Выборка.ТаблицаПоведения.Выбрать();
		Пока ВыборкаТаблицаПоведения.Следующий() Цикл
			ОбластьТаблицаПоведения.Параметры.Заполнить(ВыборкаТаблицаПоведения);
			ТабДок.Вывести(ОбластьТаблицаПоведения, ВыборкаТаблицаПоведения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
